<?php

namespace Firebed\AadeMyData\Enums;

use Firebed\AadeMyData\Services\CategoryClassificationCollection;
use Firebed\AadeMyData\Services\Classifications;
use Firebed\AadeMyData\Services\TypeClassificationCollection;

enum ExpenseClassificationType: string
{
    use HasLabels;

    /**
     *  Εμπορεύματα έναρξης
     */
    case E3_101 = "E3_101";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Χονδρικές
     */
    case E3_102_001 = "E3_102_001";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Λιανικές
     */
    case E3_102_002 = "E3_102_002";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Αγαθών του άρθρου 39α παρ.5 του Κώδικα Φ.Π.Α. (ν.2859/2000)
     */
    case E3_102_003 = "E3_102_003";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_102_004 = "E3_102_004";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες
     */
    case E3_102_005 = "E3_102_005";


    /**
     *  Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)Λοιπά
     */
    case E3_102_006 = "E3_102_006";


    /**
     *  Εμπορεύματα λήξης
     */
    case E3_104 = "E3_104";


    /**
     *  Πρώτες ύλες και υλικά έναρξης/Παραγωγή
     */
    case E3_201 = "E3_201";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Χονδρικές
     */
    case E3_202_001 = "E3_202_001";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λιανικές
     */
    case E3_202_002 = "E3_202_002";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_202_003 = "E3_202_003";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες
     */
    case E3_202_004 = "E3_202_004";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λοιπά
     */
    case E3_202_005 = "E3_202_005";


    /**
     *  Αποθέματα λήξης πρώτων υλών και υλικών/Παραγωγή
     */
    case E3_204 = "E3_204";


    /**
     *  Προϊόντα και παραγωγή σε εξέλιξη έναρξης/Παραγωγή
     */
    case E3_207 = "E3_207";


    /**
     *  Προϊόντα και παραγωγή σε εξέλιξη λήξης/Παραγωγή
     */
    case E3_209 = "E3_209";


    /**
     *  Πρώτες ύλες και υλικά έναρξης/Αγροτική
     */
    case E3_301 = "E3_301";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Χονδρικές
     */
    case E3_302_001 = "E3_302_001";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λιανικές
     */
    case E3_302_002 = "E3_302_002";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_302_003 = "E3_302_003";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες
     */
    case E3_302_004 = "E3_302_004";


    /**
     *  Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λοιπά
     */
    case E3_302_005 = "E3_302_005";


    /**
     *  Αποθέματα λήξης πρώτων υλών και υλικών/Αγροτική
     */
    case E3_304 = "E3_304";


    /**
     *  Προϊόντα και παραγωγή σε εξέλιξη έναρξης/Αγροτική
     */
    case E3_307 = "E3_307";


    /**
     *  Προϊόντα και παραγωγή σε εξέλιξη λήξης/Αγροτική
     */
    case E3_309 = "E3_309";


    /**
     *  Αποθέματα έναρξης (ζώων - φυτών)
     */
    case E3_312 = "E3_312";


    /**
     *  Αγορές ζώων - φυτών (καθαρό ποσό)/Χονδρικές
     */
    case E3_313_001 = "E3_313_001";


    /**
     *  Αγορές ζώων - φυτών (καθαρό ποσό)/Λιανικές
     */
    case E3_313_002 = "E3_313_002";


    /**
     *  Αγορές ζώων - φυτών (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_313_003 = "E3_313_003";


    /**
     *  Αγορές ζώων - φυτών (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες
     */
    case E3_313_004 = "E3_313_004";


    /**
     *  Αγορές ζώων - φυτών (καθαρό ποσό)/Λοιπά
     */
    case E3_313_005 = "E3_313_005";


    /**
     *  Αποθέματα τέλους (ζώων - φυτών)/Αγροτική
     */
    case E3_315 = "E3_315";


    /**
     *  Παροχές σε εργαζόμενους/Μικτές αποδοχές
     */
    case E3_581_001 = "E3_581_001";


    /**
     *  Παροχές σε εργαζόμενους/Εργοδοτικές εισφορές
     */
    case E3_581_002 = "E3_581_002";


    /**
     *  Παροχές σε εργαζόμενους/Λοιπές παροχές
     */
    case E3_581_003 = "E3_581_003";


    /**
     *  Ζημιές επιμέτρησης περιουσιακών στοιχείων
     */
    case E3_582 = "E3_582";


    /**
     *  Χρεωστικές συναλλαγματικές διαφορές
     */
    case E3_583 = "E3_583";


    /**
     *  Ζημιές από διάθεση-απόσυρση μή κυκλοφορούντων περιουσιακών στοιχείων
     */
    case E3_584 = "E3_584";


    /**
     *  Προμήθειες διαχείρισης ημεδαπής - αλλοδαπής (management fees)
     */
    case E3_585_001 = "E3_585_001";


    /**
     *  Δαπάνες από συνδεδεμένες επιχειρήσεις
     */
    case E3_585_002 = "E3_585_002";


    /**
     *  Δαπάνες από μη συνεργαζόμενα κράτη ή από κράτη με προνομιακό φορολογικό καθεστώς
     */
    case E3_585_003 = "E3_585_003";


    /**
     *  Δαπάνες για ενημερωτικές ημερίδες
     */
    case E3_585_004 = "E3_585_004";


    /**
     *  Έξοδα υποδοχής και φιλοξενίας
     */
    case E3_585_005 = "E3_585_005";


    /**
     *  Έξοδα ταξιδιών
     */
    case E3_585_006 = "E3_585_006";


    /**
     *  Ασφαλιστικές Εισφορές Αυτοαπασχολούμενων
     */
    case E3_585_007 = "E3_585_007";


    /**
     *  Έξοδα και προμήθειες παραγγελιοδόχου για λογαριασμό αγροτών
     */
    case E3_585_008 = "E3_585_008";


    /**
     *  Λοιπές Αμοιβές για υπηρεσίες ημεδαπής
     */
    case E3_585_009 = "E3_585_009";


    /**
     *  Λοιπές Αμοιβές για υπηρεσίες αλλοδαπής
     */
    case E3_585_010 = "E3_585_010";


    /**
     *  Ενέργεια
     */
    case E3_585_011 = "E3_585_011";


    /**
     *  Ύδρευση
     */
    case E3_585_012 = "E3_585_012";


    /**
     *  Τηλεπικοινωνίες
     */
    case E3_585_013 = "E3_585_013";


    /**
     *  Ενοίκια
     */
    case E3_585_014 = "E3_585_014";


    /**
     *  Διαφήμιση και προβολή
     */
    case E3_585_015 = "E3_585_015";


    /**
     *  Λοιπά έξοδα
     */
    case E3_585_016 = "E3_585_016";


    /**
     * Διάφορα λειτουργικά έξοδα Ζ2
     */
    case E3_585_017 = "E3_585_017";

    /**
     *  Χρεωστικοί τόκοι και συναφή έξοδα
     */
    case E3_586 = "E3_586";


    /**
     *  Αποσβέσεις
     */
    case E3_587 = "E3_587";


    /**
     *  Ασυνήθη έξοδα, ζημιές και πρόστιμα
     */
    case E3_588 = "E3_588";


    /**
     *  Προβλέψεις (εκτός από προβλέψεις για το προσωπικό)
     */
    case E3_589 = "E3_589";


    /**
     *  Αγορές ενσώματων παγίων χρήσης/Χονδρικές
     */
    case E3_882_001 = "E3_882_001";


    /**
     *  Αγορές ενσώματων παγίων χρήσης/Λιανικές
     */
    case E3_882_002 = "E3_882_002";


    /**
     *  Αγορές ενσώματων παγίων χρήσης/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_882_003 = "E3_882_003";


    /**
     *  Αγορές ενσώματων παγίων χρήσης/Εξωτερικού Τρίτες Χώρες
     */
    case E3_882_004 = "E3_882_004";


    /**
     *  Αγορές μη ενσώματων παγίων χρήσης/Χονδρικές
     */
    case E3_883_001 = "E3_883_001";


    /**
     *  Αγορές μη ενσώματων παγίων χρήσης/Λιανικές
     */
    case E3_883_002 = "E3_883_002";


    /**
     *  Αγορές μη ενσώματων παγίων χρήσης/Εξωτερικού Ενδοκοινοτικές
     */
    case E3_883_003 = "E3_883_003";


    /**
     *  Αγορές μη ενσώματων παγίων χρήσης/Εξωτερικού Τρίτες Χώρες
     */
    case E3_883_004 = "E3_883_004";


    /**
     *  Αγορές & δαπάνες στο εσωτερικό της χώρας
     */
    case VAT_361 = "VAT_361";


    /**
     *  Αγορές & εισαγωγές επενδ. Αγαθών (πάγια)
     */
    case VAT_362 = "VAT_362";


    /**
     *  Λοιπές εισαγωγές εκτός επενδ. Αγαθών (πάγια)
     */
    case VAT_363 = "VAT_363";


    /**
     *  Ενδοκοινοτικές αποκτήσεις αγαθών
     */
    case VAT_364 = "VAT_364";


    /**
     *  Ενδοκοινοτικές λήψεις υπηρεσιών άρθρ. 14.2.α
     */
    case VAT_365 = "VAT_365";


    /**
     *  Λοιπές πράξεις λήπτη
     */
    case VAT_366 = "VAT_366";

    /**
     *  Απομείωση εμπορευμάτων
     */
    case E3_103 = "E3_103";


    /**
     *  Απομείωση πρώτων υλών και υλικών
     */
    case E3_203 = "E3_203";


    /**
     *  Απομείωση πρώτων υλών και υλικών
     */
    case E3_303 = "E3_303";


    /**
     *  Απομείωση προϊόντων και παραγωγής σε εξέλιξη
     */
    case E3_208 = "E3_208";


    /**
     *  Απομείωση προϊόντων και παραγωγής σε εξέλιξη
     */
    case E3_308 = "E3_308";


    /**
     * Απομείωση ζώων - φυτών – εμπορευμάτων
     */
    case E3_314 = "E3_314";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_106 = "E3_106";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_205 = "E3_205";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_305 = "E3_305";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_210 = "E3_210";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_310 = "E3_310";


    /**
     * Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων
     */
    case E3_318 = "E3_318";


    /**
     * Αγορές αγαθών που υπάγονται σε ΕΦΚ
     */
    case E3_598_002 = "E3_598_002";


    /**
     * Μη συμμετοχή στο ΦΠΑ (έξοδα – εισροές)
     */
    case NOT_VAT_295 = "NOT_VAT_295";

    public function isVatClassification(): bool
    {
        return in_array($this, self::vatClassifications());
    }

    /** @noinspection PhpDuplicateMatchArmBodyInspection */
    public function label(): string
    {
        return match ($this) {
            self::E3_101 => "Εμπορεύματα έναρξης",
            self::E3_102_001 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Χονδρικές",
            self::E3_102_002 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Λιανικές",
            self::E3_102_003 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Αγαθών του άρθρου 39α παρ.5 του Κώδικα Φ.Π.Α. (ν.2859/2000)",
            self::E3_102_004 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές",
            self::E3_102_005 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες",
            self::E3_102_006 => "Αγορές εμπορευμάτων χρήσης (καθαρό ποσό)Λοιπά",
            self::E3_104 => "Εμπορεύματα λήξης",
            self::E3_201 => "Πρώτες ύλες και υλικά έναρξης/Παραγωγή",
            self::E3_202_001 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Χονδρικές",
            self::E3_202_002 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λιανικές",
            self::E3_202_003 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές",
            self::E3_202_004 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες",
            self::E3_202_005 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λοιπά",
            self::E3_204 => "Αποθέματα λήξης πρώτων υλών και υλικών/Παραγωγή",
            self::E3_207 => "Προϊόντα και παραγωγή σε εξέλιξη έναρξης/Παραγωγή",
            self::E3_209 => "Προϊόντα και παραγωγή σε εξέλιξη λήξης/Παραγωγή",
            self::E3_301 => "Πρώτες ύλες και υλικά έναρξης/Αγροτική",
            self::E3_302_001 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Χονδρικές",
            self::E3_302_002 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λιανικές",
            self::E3_302_003 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές",
            self::E3_302_004 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες",
            self::E3_302_005 => "Αγορές πρώτων υλών και υλικών χρήσης (καθαρό ποσό)/Λοιπά",
            self::E3_304 => "Αποθέματα λήξης πρώτων υλών και υλικών/Αγροτική",
            self::E3_307 => "Προϊόντα και παραγωγή σε εξέλιξη έναρξης/Αγροτική",
            self::E3_309 => "Προϊόντα και παραγωγή σε εξέλιξη λήξης/Αγροτική",
            self::E3_312 => "Αποθέματα έναρξης (ζώων - φυτών)",
            self::E3_313_001 => "Αγορές ζώων - φυτών (καθαρό ποσό)/Χονδρικές",
            self::E3_313_002 => "Αγορές ζώων - φυτών (καθαρό ποσό)/Λιανικές",
            self::E3_313_003 => "Αγορές ζώων - φυτών (καθαρό ποσό)/Εξωτερικού Ενδοκοινοτικές",
            self::E3_313_004 => "Αγορές ζώων - φυτών (καθαρό ποσό)/Εξωτερικού Τρίτες Χώρες",
            self::E3_313_005 => "Αγορές ζώων - φυτών (καθαρό ποσό)/Λοιπά",
            self::E3_315 => "Αποθέματα τέλους (ζώων - φυτών)/Αγροτική",
            self::E3_581_001 => "Παροχές σε εργαζόμενους/Μικτές αποδοχές",
            self::E3_581_002 => "Παροχές σε εργαζόμενους/Εργοδοτικές εισφορές",
            self::E3_581_003 => "Παροχές σε εργαζόμενους/Λοιπές παροχές",
            self::E3_582 => "Ζημιές επιμέτρησης περιουσιακών στοιχείων",
            self::E3_583 => "Χρεωστικές συναλλαγματικές διαφορές",
            self::E3_584 => "Ζημιές από διάθεση-απόσυρση μη κυκλοφορούντων περιουσιακών στοιχείων",
            self::E3_585_001 => "Προμήθειες διαχείρισης ημεδαπής - αλλοδαπής (management fees)",
            self::E3_585_002 => "Δαπάνες από συνδεδεμένες επιχειρήσεις",
            self::E3_585_003 => "Δαπάνες από μη συνεργαζόμενα κράτη ή από κράτη με προνομιακό φορολογικό καθεστώς",
            self::E3_585_004 => "Δαπάνες για ενημερωτικές ημερίδες",
            self::E3_585_005 => "Έξοδα υποδοχής και φιλοξενίας",
            self::E3_585_006 => "Έξοδα ταξιδιών",
            self::E3_585_007 => "Ασφαλιστικές Εισφορές Αυτοαπασχολούμενων",
            self::E3_585_008 => "Έξοδα και προμήθειες παραγγελιοδόχου για λογαριασμό αγροτών",
            self::E3_585_009 => "Λοιπές Αμοιβές για υπηρεσίες ημεδαπής",
            self::E3_585_010 => "Λοιπές Αμοιβές για υπηρεσίες αλλοδαπής",
            self::E3_585_011 => "Ενέργεια",
            self::E3_585_012 => "Ύδρευση",
            self::E3_585_013 => "Τηλεπικοινωνίες",
            self::E3_585_014 => "Ενοίκια",
            self::E3_585_015 => "Διαφήμιση και προβολή",
            self::E3_585_016 => "Λοιπά έξοδα",
            self::E3_585_017 => "Διάφορα λειτουργικά έξοδα Ζ2",
            self::E3_586 => "Χρεωστικοί τόκοι και συναφή έξοδα",
            self::E3_587 => "Αποσβέσεις",
            self::E3_588 => "Ασυνήθη έξοδα, ζημιές και πρόστιμα",
            self::E3_589 => "Προβλέψεις (εκτός από προβλέψεις για το προσωπικό)",
            self::E3_882_001 => "Αγορές ενσώματων παγίων χρήσης/Χονδρικές",
            self::E3_882_002 => "Αγορές ενσώματων παγίων χρήσης/Λιανικές",
            self::E3_882_003 => "Αγορές ενσώματων παγίων χρήσης/Εξωτερικού Ενδοκοινοτικές",
            self::E3_882_004 => "Αγορές ενσώματων παγίων χρήσης/Εξωτερικού Τρίτες Χώρες",
            self::E3_883_001 => "Αγορές μη ενσώματων παγίων χρήσης/Χονδρικές",
            self::E3_883_002 => "Αγορές μη ενσώματων παγίων χρήσης/Λιανικές",
            self::E3_883_003 => "Αγορές μη ενσώματων παγίων χρήσης/Εξωτερικού Ενδοκοινοτικές",
            self::E3_883_004 => "Αγορές μη ενσώματων παγίων χρήσης/Εξωτερικού Τρίτες Χώρες",
            self::VAT_361 => "Αγορές & δαπάνες στο εσωτερικό της χώρας",
            self::VAT_362 => "Αγορές & εισαγωγές επενδ. Αγαθών (πάγια)",
            self::VAT_363 => "Λοιπές εισαγωγές εκτός επενδ. Αγαθών (πάγια)",
            self::VAT_364 => "Ενδοκοινοτικές αποκτήσεις αγαθών",
            self::VAT_365 => "Ενδοκοινοτικές λήψεις υπηρεσιών άρθρ. 14.2.α",
            self::VAT_366 => "Λοιπές πράξεις λήπτη",
            self::E3_103 => "Απομείωση εμπορευμάτων",
            self::E3_203 => "Απομείωση πρώτων υλών και υλικών",
            self::E3_303 => "Απομείωση πρώτων υλών και υλικών",
            self::E3_208 => "Απομείωση προϊόντων και παραγωγής σε εξέλιξη",
            self::E3_308 => "Απομείωση προϊόντων και παραγωγής σε εξέλιξη",
            self::E3_314 => "Απομείωση ζώων - φυτών – εμπορευμάτων",
            self::E3_106 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_205 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_305 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_210 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_310 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_318 => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων",
            self::E3_598_002 => "Αγορές αγαθών που υπάγονται σε ΕΦΚ",
            self::NOT_VAT_295 => "Μη συμμετοχή στο ΦΠΑ (έξοδα – εισροές)",
        };
    }

    public static function for(InvoiceType $type, ExpenseClassificationCategory $category = null): CategoryClassificationCollection|TypeClassificationCollection
    {
        return Classifications::expenseClassifications($type, $category);
    }

    public static function vatClassifications(): array
    {
        return [
            self::VAT_361,
            self::VAT_362,
            self::VAT_363,
            self::VAT_364,
            self::VAT_365,
            self::VAT_366,
            self::NOT_VAT_295,
        ];
    }
}
