<?php

namespace Firebed\AadeMyData\Enums;

use Firebed\AadeMyData\Enums\Traits\HasLabels;

enum FeesPercentCategory: int
{
    use HasLabels;
    
    /**
     *  Για μηνιαίο λογαριασμό μέχρι και 50 ευρώ 12% [12,00%]
     */
    case TYPE_1 = 1;


    /**
     *  Για μηνιαίο λογαριασμό από 50,01 μέχρι και 100 ευρώ 15% [15,00%]
     */
    case TYPE_2 = 2;


    /**
     *  Για μηνιαίο λογαριασμό από 100,01 μέχρι και 150 ευρώ 18% [18,00%]
     */
    case TYPE_3 = 3;


    /**
     *  Για μηνιαίο λογαριασμό από 150,01 ευρώ και άνω 20% [20,00%]
     */
    case TYPE_4 = 4;


    /**
     *  Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας (12%) [12,00%]
     */
    case TYPE_5 = 5;


    /**
     *  Τέλος στη συνδρομητική τηλεόραση 10% [10,00%]
     */
    case TYPE_6 = 6;


    /**
     *  Τέλος συνδρομητών σταθερής τηλεφωνίας 5% [5,00%]
     */
    case TYPE_7 = 7;


    /**
     *  Περιβαλλοντικό Τέλος & πλαστικής σακούλας ν. 2339/2001 αρ. 6α 0,07 ευρώ ανά τεμάχιο [ποσό]
     */
    case TYPE_8 = 8;


    /**
     *  Εισφορά δακοκτονίας 2% [2,00%]
     */
    case TYPE_9 = 9;


    /**
     *  Λοιπά τέλη [ποσό]
     */
    case TYPE_10 = 10;

    
    /**
     *  Τέλη Λοιπών Φόρων [ποσό]
     */
    case TYPE_11 = 11;

    
    /**
     *  ΤΕισφορά δακοκτονίας [ποσό]
     */
    case TYPE_12 = 12;
    
    
    /**
     *  Για μηνιαίο λογαριασμό κάθε σύνδεσης (10%) 10%
     */
    case TYPE_13 = 13;


    /**
     *  Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας (10%) 10%
     */
    case TYPE_14 = 14;


    /**
     *  Τέλος κινητής και καρτοκινητής για φυσικά πρόσωπα ηλικίας 15 έως και 29 ετών (0%) 0%
     */
    case TYPE_15 = 15;


    /**
     *  Εισφορά προστασίας περιβάλλοντος πλαστικών προϊόντων 0,04 λεπτά ανά τεμάχιο [άρθρο 4 ν. 4736/2020] ποσό
     */
    case TYPE_16 = 16;


    /**
     *  Τέλος ανακύκλωσης 0,08 λεπτά ανά τεμάχιο [άρθρο 80 ν. 4819/2021] Ποσό
     */
    case TYPE_17 = 17;


    /**
     *  Τέλος διαμονής παρεπιδημούντων Ποσό
     */
    case TYPE_18 = 18;


    /**
     *  Tέλος επί των ακαθάριστων εσόδων των εστιατορίων και συναφών καταστημάτων Ποσό
     */
    case TYPE_19 = 19;


    /**
     *  Τέλος επί των ακαθάριστων εσόδων των κέντρων διασκέδασης Ποσό
     */
    case TYPE_20 = 20;


    /**
     *  Τέλος επί των ακαθάριστων εσόδων των καζίνο Ποσό
     */
    case TYPE_21 = 21;


    /**
     *  Λοιπά τέλη επί των ακαθάριστων εσόδων Ποσό
     */
    case TYPE_22 = 22;

    public function label(): string
    {
        return match ($this) {
            self::TYPE_1  => "Για μηνιαίο λογαριασμό μέχρι και 50 ευρώ 12%",
            self::TYPE_2  => "Για μηνιαίο λογαριασμό από 50,01 μέχρι και 100 ευρώ 15%",
            self::TYPE_3  => "Για μηνιαίο λογαριασμό από 100,01 μέχρι και 150 ευρώ 18%",
            self::TYPE_4  => "Για μηνιαίο λογαριασμό από 150,01 ευρώ και άνω 20%",
            self::TYPE_5  => "Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας (12%)",
            self::TYPE_6  => "Τέλος στη συνδρομητική τηλεόραση 10%",
            self::TYPE_7  => "Τέλος συνδρομητών σταθερής τηλεφωνίας 5%",
            self::TYPE_8  => "Περιβαλλοντικό Τέλος & πλαστικής σακούλας ν. 2339/2001 αρ. 6α 0,07 ευρώ ανά τεμάχιο",
            self::TYPE_9  => "Εισφορά δακοκτονίας 2%",
            self::TYPE_10 => "Λοιπά τέλη",
            self::TYPE_11 => "Τέλη Λοιπών Φόρων",
            self::TYPE_12 => "ΤΕισφορά δακοκτονίας",
            self::TYPE_13 => "Για μηνιαίο λογαριασμό κάθε σύνδεσης 10%",
            self::TYPE_14 => "Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας (10%)",
            self::TYPE_15 => "Τέλος κινητής και καρτοκινητής για φυσικά πρόσωπα ηλικίας 15 έως και 29 ετών 0%",
            self::TYPE_16 => "Εισφορά προστασίας περιβάλλοντος πλαστικών προϊόντων 0,04 λεπτά ανά τεμάχιο [άρθρο 4 ν. 4736/2020]",
            self::TYPE_17 => "Τέλος ανακύκλωσης 0,08 λεπτά ανά τεμάχιο [άρθρο 80 ν. 4819/2021]",
            self::TYPE_18 => "Τέλος διαμονής παρεπιδημούντων",
            self::TYPE_19 => "Tέλος επί των ακαθάριστων εσόδων των εστιατορίων και συναφών καταστημάτων",
            self::TYPE_20 => "Τέλος επί των ακαθάριστων εσόδων των κέντρων διασκέδασης",
            self::TYPE_21 => "Τέλος επί των ακαθάριστων εσόδων των καζίνο",
            self::TYPE_22 => "Λοιπά τέλη επί των ακαθάριστων εσόδων",
        };
    }
}