<?php

namespace Firebed\AadeMyData\Enums;

use Firebed\AadeMyData\Enums\Traits\HasLabels;

enum IncomeClassificationType: string
{
    use HasLabels;
    
    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα
     */
    case E3_106 = "E3_106";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
     */
    case E3_205 = "E3_205";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
     */
    case E3_210 = "E3_210";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
     */
    case E3_305 = "E3_305";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
     */
    case E3_310 = "E3_310";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής
     */
    case E3_318 = "E3_318";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών
     */
    case E3_561_001 = "E3_561_001";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
     */
    case E3_561_002 = "E3_561_002";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία
     */
    case E3_561_003 = "E3_561_003";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
     */
    case E3_561_004 = "E3_561_004";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές
     */
    case E3_561_005 = "E3_561_005";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες
     */
    case E3_561_006 = "E3_561_006";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λοιπά
     */
    case E3_561_007 = "E3_561_007";


    /**
     *  Λοιπά συνήθη έσοδα
     */
    case E3_562 = "E3_562";


    /**
     *  Πιστωτικοί τόκοι και συναφή έσοδα
     */
    case E3_563 = "E3_563";


    /**
     *  Πιστωτικές συναλλαγματικές διαφορές
     */
    case E3_564 = "E3_564";


    /**
     *  Έσοδα συμμετοχών
     */
    case E3_565 = "E3_565";


    /**
     *  Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων
     */
    case E3_566 = "E3_566";


    /**
     *  Κέρδη από αναστροφή προβλέψεων και απομειώσεων
     */
    case E3_567 = "E3_567";


    /**
     *  Κέρδη από επιμέτρηση στην εύλογη αξία
     */
    case E3_568 = "E3_568";


    /**
     *  Ασυνήθη έσοδα και κέρδη
     */
    case E3_570 = "E3_570";


    /**
     *  Έξοδα σε ιδιοπαραγωγή
     */
    case E3_595 = "E3_595";


    /**
     *  Επιδοτήσεις - Επιχορηγήσεις
     */
    case E3_596 = "E3_596";


    /**
     *  Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών
     */
    case E3_597 = "E3_597";


    /**
     *  Πωλήσεις Παγίων Χονδρικές
     */
    case E3_880_001 = "E3_880_001";


    /**
     *  Πωλήσεις Παγίων Λιανικές
     */
    case E3_880_002 = "E3_880_002";


    /**
     *  Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές
     */
    case E3_880_003 = "E3_880_003";


    /**
     *  Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες
     */
    case E3_880_004 = "E3_880_004";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Χονδρικές
     */
    case E3_881_001 = "E3_881_001";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Λιανικές
     */
    case E3_881_002 = "E3_881_002";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Ενδοκοινοτικές
     */
    case E3_881_003 = "E3_881_003";
    
    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Τρίτες Χώρες
     */
    case E3_881_004 = "E3_881_004";

    /**
     *  Πωλήσεις αγαθών που υπάγονται σε ΕΦΚ
     */
    case E3_598_001 = "E3_598_001";

    /**
     *  Πωλήσεις για λογαριασμό αγροτών μέσω αγροτικού συνεταιρισμού κ.λ.π
     */
    case E3_598_003 = "E3_598_003";

    public function label(): string
    {
        return match ($this) {
            self::E3_106     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα",
            self::E3_205     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
            self::E3_210     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
            self::E3_305     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά",
            self::E3_310     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη",
            self::E3_318     => "Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής",
            self::E3_561_001 => "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών",
            self::E3_561_002 => "Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
            self::E3_561_003 => "Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία",
            self::E3_561_004 => "Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)",
            self::E3_561_005 => "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές",
            self::E3_561_006 => "Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες",
            self::E3_561_007 => "Πωλήσεις αγαθών και υπηρεσιών Λοιπά",
            self::E3_562     => "Λοιπά συνήθη έσοδα",
            self::E3_563     => "Πιστωτικοί τόκοι και συναφή έσοδα",
            self::E3_564     => "Πιστωτικές συναλλαγματικές διαφορές",
            self::E3_565     => "Έσοδα συμμετοχών",
            self::E3_566     => "Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων",
            self::E3_567     => "Κέρδη από αναστροφή προβλέψεων και απομειώσεων",
            self::E3_568     => "Κέρδη από επιμέτρηση στην εύλογη αξία",
            self::E3_570     => "Ασυνήθη έσοδα και κέρδη",
            self::E3_595     => "Έξοδα σε ιδιοπαραγωγή",
            self::E3_596     => "Επιδοτήσεις - Επιχορηγήσεις",
            self::E3_597     => "Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών",
            self::E3_880_001 => "Πωλήσεις Παγίων Χονδρικές",
            self::E3_880_002 => "Πωλήσεις Παγίων Λιανικές",
            self::E3_880_003 => "Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές",
            self::E3_880_004 => "Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες",
            self::E3_881_001 => "Πωλήσεις για λογ/σμο Τρίτων Χονδρικές",
            self::E3_881_002 => "Πωλήσεις για λογ/σμο Τρίτων Λιανικές",
            self::E3_881_003 => "Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Ενδοκοινοτικές",
            self::E3_881_004 => "Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Τρίτες Χώρες",
            self::E3_598_001 => "Πωλήσεις αγαθών που υπάγονται σε ΕΦΚ",
            self::E3_598_003 => "Πωλήσεις για λογαριασμό αγροτών μέσω αγροτικού συνεταιρισμού κ.λ.π",
        };
    }
}