<?php

namespace Firebed\AadeMyData\Enums;

use Firebed\AadeMyData\Enums\Traits\HasLabels;

enum OtherTaxesPercentCategory: int
{
    use HasLabels;
    
    /**
     *  α1) ασφάλιστρα κλάδου πυρός 20%
     */
    case TAX_1 = 1;


    /**
     *  α2) ασφάλιστρα κλάδου πυρός 20%
     */
    case TAX_2 = 2;


    /**
     *  β) ασφάλιστρα κλάδου ζωής 4%
     */
    case TAX_3 = 3;


    /**
     *  γ) ασφάλιστρα λοιπών κλάδων 15%.
     */
    case TAX_4 = 4;


    /**
     *  δ) απαλλασσόμενα φόρου ασφαλίστρων 0%.
     */
    case TAX_5 = 5;


    /**
     *  Ξενοδοχεία 1-2 αστέρων 0,50 €
     */
    case TAX_6 = 6;


    /**
     *  Ξενοδοχεία 3 αστέρων 1,50 €
     */
    case TAX_7 = 7;


    /**
     *  Ξενοδοχεία 4 αστέρων 3,00 €
     */
    case TAX_8 = 8;


    /**
     *  Ξενοδοχεία 4 αστέρων 4,00 €
     */
    case TAX_9 = 9;


    /**
     *  Ενοικιαζόμενα - επιπλωμένα δωμάτια - διαμερίσματα 0,50 € ποσό
     */
    case TAX_10 = 10;


    /**
     *  Ειδικός Φόρος στις διαφημίσεις που προβάλλονται από την τηλεόραση (ΕΦΤΔ) 5%
     */
    case TAX_11 = 11;


    /**
     *  3.1 Φόρος πολυτελείας 10% επί της φορολογητέας αξίας για τα ενδοκοινοτικώς αποκτούμενα και εισαγόμενα από τρίτες χώρες 10%
     */
    case TAX_12 = 12;


    /**
     *  3.2 Φόρος πολυτελείας 10% επί της τιμής πώλησης προ Φ.Π.Α. για τα εγχωρίως παραγόμενα  είδη 10%
     */
    case TAX_13 = 13;


    /**
     *  Δικαίωμα του Δημοσίου στα εισιτήρια των καζίνο (80% επί του εισιτηρίου)
     */
    case TAX_14 = 14;


    /**
     *  ασφάλιστρα κλάδου πυρός 20%
     */
    case TAX_15 = 15;


    /**
     *  Τελωνειακοί Δασμοί-Φόροι
     */
    case TAX_16 = 16;


    /**
     *  Λοιποί Φόροι
     */
    case TAX_17 = 17;


    /**
     *  Επιβαρύνσεις Λοιπών Φόρων
     */
    case TAX_18 = 18;


    /**
     *  ΕΦΚ ποσό
     */
    case TAX_19 = 19;


    /**
     * Ξενοδοχεία 1-2 αστέρων 1,50€ (ανά Δωμ./Διαμ.)
     */
    case TAX_20 = 20;


    /**
     *  Ξενοδοχεία 3 αστέρων 3, 00€ (ανά Δωμ./Διαμ.) ποσό
     */
    case TAX_21 = 21;
    
    
    /**
     *  Ξενοδοχεία 4 αστέρων 7, 00€ (ανά Δωμ./Διαμ.) ποσό
     */
    case TAX_22 = 22;
    
    
    /**
     *  Ξενοδοχεία 5 αστέρων 10, 00€ (ανά Δωμ./Διαμ.) ποσό
     */
    case TAX_23 = 23;
    
    
    /**
     *  Ενοικιαζόμενα επιπλωμένα δωμάτια – διαμερίσματα 1, 50€ (ανά Δωμ./Διαμ.) ποσό
     */
    case TAX_24 = 24;
    
    
    /**
     *  Ακίνητα βραχυχρόνιας μίσθωσης 1,50€ ποσό
     */
    case TAX_25 = 25;
    
    
    /**
     *  Ακίνητα βραχυχρόνιας μίσθωσης μονοκατοικίες άνω των 80 τ.μ. 10,00€ ποσό
     */
    case TAX_26 = 26;
    
    
    /**
     *  Αυτοεξυπηρετούμενα καταλύματα – τουριστικές επιπλωμένες επαύλεις (βίλες) 10,00€ ποσό
     */
    case TAX_27 = 27;
    
    
    /**
     *  Ακίνητα βραχυχρόνιας μίσθωσης 0,50€ ποσό
     */
    case TAX_28 = 28;
    
    
    /**
     *  Ακίνητα βραχυχρόνιας μίσθωσης μονοκατοικίες άνω των 80 τ.μ. 4,00€ ποσό
     */
    case TAX_29 = 29;
    
    
    /**
     *  Αυτοεξυπηρετούμενα καταλύματα – τουριστικές επιπλωμένες επαύλεις (βίλες) 4,00€ ποσό
     */
    case TAX_30 = 30;

    public function label(): string
    {
        return match($this) {
            self::TAX_1  => "α1) ασφάλιστρα κλάδου πυρός 20%",
            self::TAX_2  => "α2) ασφάλιστρα κλάδου πυρός 20%",
            self::TAX_3  => "β) ασφάλιστρα κλάδου ζωής 4%",
            self::TAX_4  => "γ) ασφάλιστρα λοιπών κλάδων 15%",
            self::TAX_5  => "δ) απαλλασσόμενα φόρου ασφαλίστρων 0%",
            self::TAX_6  => "Ξενοδοχεία 1-2 αστέρων 0,50€",
            self::TAX_7  => "Ξενοδοχεία 3 αστέρων 1,50€",
            self::TAX_8  => "Ξενοδοχεία 4 αστέρων 3,00€",
            self::TAX_9  => "Ξενοδοχεία 4 αστέρων 4,00€",
            self::TAX_10 => "Ενοικιαζόμενα - επιπλωμένα δωμάτια - διαμερίσματα 0,50€",
            self::TAX_11 => "Ειδικός Φόρος στις διαφημίσεις που προβάλλονται από την τηλεόραση (ΕΦΤΔ) 5%",
            self::TAX_12 => "3.1 Φόρος πολυτελείας 10% επί της φορολογητέας αξίας για τα ενδοκοινοτικώς αποκτούμενα και εισαγόμενα από τρίτες χώρες 10%",
            self::TAX_13 => "3.2 Φόρος πολυτελείας 10% επί της τιμής πώλησης προ Φ.Π.Α. για τα εγχωρίως παραγόμενα είδη 10%",
            self::TAX_14 => "Δικαίωμα του Δημοσίου στα εισιτήρια των καζίνο (80% επί του εισιτηρίου)",
            self::TAX_15 => "ασφάλιστρα κλάδου πυρός 20%",
            self::TAX_16 => "Τελωνειακοί Δασμοί-Φόροι",
            self::TAX_17 => "Λοιποί Φόροι",
            self::TAX_18 => "Επιβαρύνσεις Λοιπών Φόρων",
            self::TAX_19 => "ΕΦΚ",
            self::TAX_20 => "Ξενοδοχεία 1-2 αστέρων 1,50€ (ανά Δωμ./Διαμ.)",
            self::TAX_21 => "Ξενοδοχεία 3 αστέρων 3, 00€ (ανά Δωμ./Διαμ.)",
            self::TAX_22 => "Ξενοδοχεία 4 αστέρων 7, 00€ (ανά Δωμ./Διαμ.)",
            self::TAX_23 => "Ξενοδοχεία 5 αστέρων 10, 00€ (ανά Δωμ./Διαμ.)",
            self::TAX_24 => "Ενοικιαζόμενα επιπλωμένα δωμάτια – διαμερίσματα 1, 50€ (ανά Δωμ./Διαμ.)",
            self::TAX_25 => "Ακίνητα βραχυχρόνιας μίσθωσης 1,50€",
            self::TAX_26 => "Ακίνητα βραχυχρόνιας μίσθωσης μονοκατοικίες άνω των 80 τ.μ. 10,00€",
            self::TAX_27 => "Αυτοεξυπηρετούμενα καταλύματα – τουριστικές επιπλωμένες επαύλεις (βίλες) 10,00€",
            self::TAX_28 => "Ακίνητα βραχυχρόνιας μίσθωσης 0,50€",
            self::TAX_29 => "Ακίνητα βραχυχρόνιας μίσθωσης μονοκατοικίες άνω των 80 τ.μ. 4,00€",
            self::TAX_30 => "Αυτοεξυπηρετούμενα καταλύματα – τουριστικές επιπλωμένες επαύλεις (βίλες) 4,00€",
        };
    }
}