<?php

namespace Firebed\AadeMyData\Enums;

use Firebed\AadeMyData\Enums\Traits\HasLabels;

enum RecType: int
{
    use HasLabels;
    
    /**
     *  Ειδική Γραμμή Παρακρατούμενων Φόρων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_1 = 1;


    /**
     *  Γραμμή Τέλους με Φ.Π.Α.
     */
    case TYPE_2 = 2;


    /**
     *  Γραμμή Λοιπών Φόρων με Φ.Π.Α.
     */
    case TYPE_3 = 3;


    /**
     *  Ειδική Γραμμή Χαρτοσήμου Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_4 = 4;


    /**
     *  Ειδική Γραμμή Κρατήσεων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_5 = 5;


    /**
     *  Δωροεπιταγή
     */
    case TYPE_6 = 6;


    /**
     * Αρνητικό πρόσημο αξιών. Έγκυρο μόνο στις περιπτώσεις
     * των παραστατικών 17.3, 17.4, 17.5 και 17.6 και υποδηλώνει
     * ότι τα ποσά των αξιών της γραμμής είναι αρνητικά
     */
    case TYPE_7 = 7;

    public function label(): string
    {
        return match($this) {
            self::TYPE_1 => "Ειδική Γραμμή Παρακρατούμενων Φόρων Ανενεργός - για μελλοντική χρήση",
            self::TYPE_2 => "Γραμμή Τέλους με Φ.Π.Α.",
            self::TYPE_3 => "Γραμμή Λοιπών Φόρων με Φ.Π.Α.",
            self::TYPE_4 => "Ειδική Γραμμή Χαρτοσήμου Ανενεργός - για μελλοντική χρήση",
            self::TYPE_5 => "Ειδική Γραμμή Κρατήσεων Ανενεργός - για μελλοντική χρήση",
            self::TYPE_6 => "Δωροεπιταγή",
            self::TYPE_7 => "Αρνητικό πρόσημο αξιών",
        };
    }
}