<?php

namespace Firebed\AadeMyData\Enums;

enum RecType: string
{
    /**
     *  Ειδική Γραμμή Παρακρατούμενων Φόρων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_1 = "1";


    /**
     *  Γραμμή Τέλους με Φ.Π.Α.
     */
    case TYPE_2 = "2";


    /**
     *  Γραμμή Λοιπών Φόρων με Φ.Π.Α.
     */
    case TYPE_3 = "3";


    /**
     *  Ειδική Γραμμή Χαρτοσήμου Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_4 = "4";


    /**
     *  Ειδική Γραμμή Κρατήσεων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_5 = "5";


    /**
     *  Δωροεπιταγή
     */
    case TYPE_6 = "6";


    /**
     * Αρνητικό πρόσημο αξιών. Έγκυρο μόνο στις περιπτώσεις
     * των παραστατικών 17.3, 17.4, 17.5 και 17.6 και υποδηλώνει
     * ότι τα ποσά των αξιών της γραμμής είναι αρνητικά
     */
    case TYPE_7 = "7";
}