<?php

namespace Firebed\AadeMyData\Enums;

enum RecType: string
{
    /**
     *  Ειδική Γραμμή Παρακρατούμενων Φόρων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_1 = "1";


    /**
     *  Γραμμή Τέλους με Φ.Π.Α.
     */
    case TYPE_2 = "2";


    /**
     *  Γραμμή Λοιπών Φόρων με Φ.Π.Α.
     */
    case TYPE_3 = "3";


    /**
     *  Ειδική Γραμμή Χαρτοσήμου Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_4 = "4";


    /**
     *  Ειδική Γραμμή Κρατήσεων Ανενεργός - για μελλοντική χρήση
     */
    case TYPE_5 = "5";


    /**
     *  Δωροεπιταγή
     */
    case TYPE_6 = "6";
}