<?php

namespace Firebed\AadeMyData\Enums;

enum SpecialInvoiceCategory: int
{
    /**
     *  Επιδοτήσεις – Επιχορηγήσεις
     */
    case TYPE_1 = 1;


    /**
     *  Έσοδα Λιανικής Ξενοδοχείων
     */
    case TYPE_2 = 2;


    /**
     *  Λογιστική Εγγραφή
     */
    case TYPE_3 = 3;


    /**
     * Tax Free
     * Έγκυρη τιμή μόνο για διαβίβαση μέσω erp ή έκδοση μέσω παρόχου ή timologio
     */
    case TYPE_4 = 4;


    /**
     * Σύνθετες συναλλαγές ημεδαπής – αλλοδαπής
     * 
     * @version 1.0.7
     */
    case TYPE_5 = 5;


    /**
     * Δικαιούχοι του άρθρου 3 της υπό στοιχεία 139818 ΕΞ2022/28.09.2022 (Β’5083) κοινής υπουργικής απόφασης
     * 
     * @version 1.0.7
     */
    case TYPE_6 = 6;


    /**
     * Αγορά αγροτικών αγαθών υπηρεσιών Άρθρο 41 του Κώδικα ΦΠΑ
     * 
     * @version 1.0.7
     */
    case TYPE_7 = 7;


    /**
     * Έσοδα Λιανικών ΦΗΜ ΑΑΔΕ_1
     * Μόνο για ανάγνωση – μη έγκυρη τιμή για αποστολή μέσω ERP / Πάροχο
     * 
     * @version 1.0.7
     */
    case TYPE_8 = 8;


    /**
     * Έσοδα Λιανικών ΦΗΜ ΑΑΔΕ_2
     * Μόνο για ανάγνωση – μη έγκυρη τιμή για αποστολή μέσω ERP / Πάροχο
     *
     * @version 1.0.7
     */
    case TYPE_9 = 9;


    /**
     * Έσοδα Λιανικών ΦΗΜ Επιχείρησης Απόκλιση
     *
     * @version 1.0.7
     */
    case TYPE_10 = 10;


    /**
     *  Επίδομα Θέρμανσης
     */
    case TYPE_11 = 11;

    
    /**
     *  Συναλλαγές εστίασης
     */
    case TYPE_12 = 12;
}