<?php

namespace Firebed\AadeMyData\Enums;

enum VatExemption: int
{
    use HasLabels;

    /**
     * Χωρίς ΦΠΑ - άρθρο 2 και 3 του Κώδικα ΦΠΑ
     */
    case TYPE_1 = 1;


    /**
     * Χωρίς ΦΠΑ - άρθρο 5 του Κώδικα ΦΠΑ
     */
    case TYPE_2 = 2;


    /**
     * Χωρίς ΦΠΑ - άρθρο 17 του Κώδικα ΦΠΑ
     */
    case TYPE_3 = 3;


    /**
     * Χωρίς ΦΠΑ - άρθρο 18 του Κώδικα ΦΠΑ
     */
    case TYPE_4 = 4;


    /**
     * Χωρίς ΦΠΑ - άρθρο 21 του Κώδικα ΦΠΑ
     */
    case TYPE_5 = 5;


    /**
     * Χωρίς ΦΠΑ - άρθρο 24 του Κώδικα ΦΠΑ
     */
    case TYPE_6 = 6;


    /**
     * Χωρίς ΦΠΑ - άρθρο 27 του Κώδικα ΦΠΑ
     */
    case TYPE_7 = 7;


    /**
     * Χωρίς ΦΠΑ - άρθρο 29 του Κώδικα ΦΠΑ
     */
    case TYPE_8 = 8;


    /**
     * Χωρίς ΦΠΑ - άρθρο 30 του Κώδικα ΦΠΑ
     */
    case TYPE_9 = 9;


    /**
     * Χωρίς ΦΠΑ - άρθρο 31 του Κώδικα ΦΠΑ
     */
    case TYPE_10 = 10;


    /**
     * Χωρίς ΦΠΑ - άρθρο 32 του Κώδικα ΦΠΑ
     */
    case TYPE_11 = 11;


    /**
     * Χωρίς ΦΠΑ - άρθρο 32 του Κώδικα ΦΠΑ - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ
     */
    case TYPE_12 = 12;


    /**
     * Χωρίς ΦΠΑ - άρθρο 32 .1.γ. του Κώδικα ΦΠΑ - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ
     */
    case TYPE_13 = 13;


    /**
     * Χωρίς ΦΠΑ - άρθρο 33 του Κώδικα ΦΠΑ
     */
    case TYPE_14 = 14;


    /**
     * Χωρίς ΦΠΑ - άρθρο 44 του Κώδικα ΦΠΑ
     */
    case TYPE_15 = 15;


    /**
     * Χωρίς ΦΠΑ - άρθρο 45 του Κώδικα ΦΠΑ
     */
    case TYPE_16 = 16;


    /**
     * Χωρίς ΦΠΑ - άρθρο 47 του Κώδικα ΦΠΑ
     */
    case TYPE_17 = 17;


    /**
     * Χωρίς ΦΠΑ - άρθρο 48 του Κώδικα ΦΠΑ
     */
    case TYPE_18 = 18;


    /**
     * Χωρίς ΦΠΑ - άρθρο 54 του Κώδικα ΦΠΑ
     */
    case TYPE_19 = 19;


    /**
     * ΦΠΑ εμπεριεχόμενος - άρθρο 50 του Κώδικα ΦΠΑ
     */
    case TYPE_20 = 20;


    /**
     * ΦΠΑ εμπεριεχόμενος - άρθρο 51 του Κώδικα ΦΠΑ
     */
    case TYPE_21 = 21;


    /**
     * ΦΠΑ εμπεριεχόμενος - άρθρο 52 του Κώδικα ΦΠΑ
     */
    case TYPE_22 = 22;


    /**
     * ΦΠΑ εμπεριεχόμενος - άρθρο 53 του Κώδικα ΦΠΑ
     */
    case TYPE_23 = 23;


    /**
     * Χωρίς ΦΠΑ - άρθρο 8 του Κώδικα ΦΠΑ
     */
    case TYPE_24 = 24;


    /**
     * Χωρίς ΦΠΑ - ΠΟΛ.1029/1995
     */
    case TYPE_25 = 25;


    /**
     * Χωρίς ΦΠΑ - ΠΟΛ.1167/2015
     */
    case TYPE_26 = 26;


    /**
     * Λοιπές Εξαιρέσεις ΦΠΑ
     */
    case TYPE_27 = 27;


    /**
     * Χωρίς ΦΠΑ – άρθρο 29 περ. β’ παρ.1 του Κώδικα ΦΠΑ, (Tax Free)
     */
    case TYPE_28 = 28;


    /**
     * Χωρίς ΦΠΑ – άρθρο 56 του Κώδικα ΦΠΑ (OSS_μη ενωσιακό καθεστώς)
     */
    case TYPE_29 = 29;


    /**
     * Χωρίς ΦΠΑ – άρθρο 57 του Κώδικα ΦΠΑ (OSS_ενωσιακό καθεστώς)
     */
    case TYPE_30 = 30;


    /**
     * Χωρίς ΦΠΑ – άρθρο 58 του Κώδικα ΦΠΑ (IOSS)
     */
    case TYPE_31 = 31;

    public function label(): string
    {
        return match($this) {
            self::TYPE_1  => "Χωρίς ΦΠΑ - άρθρο 2 και 3 του Κώδικα ΦΠΑ",
            self::TYPE_2  => "Χωρίς ΦΠΑ - άρθρο 5 του Κώδικα ΦΠΑ",
            self::TYPE_3  => "Χωρίς ΦΠΑ - άρθρο 17 του Κώδικα ΦΠΑ",
            self::TYPE_4  => "Χωρίς ΦΠΑ - άρθρο 18 του Κώδικα ΦΠΑ",
            self::TYPE_5  => "Χωρίς ΦΠΑ - άρθρο 21 του Κώδικα ΦΠΑ",
            self::TYPE_6  => "Χωρίς ΦΠΑ - άρθρο 24 του Κώδικα ΦΠΑ",
            self::TYPE_7  => "Χωρίς ΦΠΑ - άρθρο 27 του Κώδικα ΦΠΑ",
            self::TYPE_8  => "Χωρίς ΦΠΑ - άρθρο 29 του Κώδικα ΦΠΑ",
            self::TYPE_9  => "Χωρίς ΦΠΑ - άρθρο 30 του Κώδικα ΦΠΑ",
            self::TYPE_10 => "Χωρίς ΦΠΑ - άρθρο 31 του Κώδικα ΦΠΑ",
            self::TYPE_11 => "Χωρίς ΦΠΑ - άρθρο 32 του Κώδικα ΦΠΑ",
            self::TYPE_12 => "Χωρίς ΦΠΑ - άρθρο 32 του Κώδικα ΦΠΑ - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ",
            self::TYPE_13 => "Χωρίς ΦΠΑ - άρθρο 32 .1.γ. του Κώδικα ΦΠΑ - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ",
            self::TYPE_14 => "Χωρίς ΦΠΑ - άρθρο 33 του Κώδικα ΦΠΑ",
            self::TYPE_15 => "Χωρίς ΦΠΑ - άρθρο 44 του Κώδικα ΦΠΑ",
            self::TYPE_16 => "Χωρίς ΦΠΑ - άρθρο 45 του Κώδικα ΦΠΑ",
            self::TYPE_17 => "Χωρίς ΦΠΑ - άρθρο 47 του Κώδικα ΦΠΑ",
            self::TYPE_18 => "Χωρίς ΦΠΑ - άρθρο 48 του Κώδικα ΦΠΑ",
            self::TYPE_19 => "Χωρίς ΦΠΑ - άρθρο 54 του Κώδικα ΦΠΑ",
            self::TYPE_20 => "ΦΠΑ εμπεριεχόμενος - άρθρο 50 του Κώδικα ΦΠΑ",
            self::TYPE_21 => "ΦΠΑ εμπεριεχόμενος - άρθρο 51 του Κώδικα ΦΠΑ",
            self::TYPE_22 => "ΦΠΑ εμπεριεχόμενος - άρθρο 52 του Κώδικα ΦΠΑ",
            self::TYPE_23 => "ΦΠΑ εμπεριεχόμενος - άρθρο 53 του Κώδικα ΦΠΑ",
            self::TYPE_24 => "Χωρίς ΦΠΑ - άρθρο 8 του Κώδικα ΦΠΑ",
            self::TYPE_25 => "Χωρίς ΦΠΑ - ΠΟΛ.1029/1995",
            self::TYPE_26 => "Χωρίς ΦΠΑ - ΠΟΛ.1167/2015",
            self::TYPE_27 => "Λοιπές Εξαιρέσεις ΦΠΑ",
            self::TYPE_28 => "Χωρίς ΦΠΑ – άρθρο 29 περ. β’ παρ.1 του Κώδικα ΦΠΑ, (Tax Free)",
            self::TYPE_29 => "Χωρίς ΦΠΑ – άρθρο 56 του Κώδικα ΦΠΑ (OSS_μη ενωσιακό καθεστώς)",
            self::TYPE_30 => "Χωρίς ΦΠΑ – άρθρο 57 του Κώδικα ΦΠΑ (OSS_ενωσιακό καθεστώς)",
            self::TYPE_31 => "Χωρίς ΦΠΑ – άρθρο 58 του Κώδικα ΦΠΑ (IOSS)",
        };
    }
}
