<?php

namespace Firebed\AadeMyData\Http;

/**
 * <p>Αυτή η POST μέθοδος, που είναι διαθέσιμη μόνο για πιστοποιημένους παρόχους,
 * χρησιμοποιείται για την ακύρωση ενός δελτίου αποστολής χωρίς επαναϋποβολή
 * καινούργιου. Ο χρήστης την καλεί υποβάλλοντας ως παράμετρο το mark του δελτίου
 * αποστολής το οποίο θέλει να ακυρώσει καθώς και την παράμετρο entityVatNumber που
 * είναι το ΑΦΜ της οντότητας που εξέδωσε το προς ακύρωση δελτίο αποστολής. Η μέθοδος
 * έχει headers, όπως περιγράφονται στην παράγραφο 4.1.2 Δεν απαιτείται αποστολή xml
 * body.</p>
 *
 * <p>Σε περίπτωση επιτυχίας η ακύρωση ως πράξη λαμβάνει το δικό της mark το οποίο
 * επιστρέφεται στον χρήστη και το δελτίο αποστολής θεωρείται ακυρωμένο. Σε περίπτωση
 * αποτυχίας επιστρέφεται το αντίστοιχο μήνυμα λάθους.</p>
 *
 * @version 1.0.11
 */
class CancelDeliveryNote extends CancelInvoice
{
}