<?php

namespace Firebed\AadeMyData\Http;

/**
 * <p>Με αυτή τη μέθοδο ο χρήστης λαμβάνει παραστατικά, χαρακτηρισμούς και ακυρώσεις
 * παραστατικών <strong>που έχει υποβάλλει ο ίδιος</strong> και τον αφορούν.</p>
 *
 * <p>Η κλήση επιστρέφει όσα στοιχεία αφορούν τον χρήστη και έχουν ως αναγνωριστικό
 * Μοναδικό Αριθμό Καταχώρησης μεγαλύτερο της παραμέτρου. </p>
 *
 * <p>Στην περίπτωση που τα αποτελέσματα αναζήτησης ξεπερνούν σε μέγεθος το
 * μέγιστο επιτρεπτό όριο ο χρήστης θα τα λάβει τμηματικά. Τα πεδία nextPartitionKey και
 * nextRowKey θα εμπεριέχονται σε κάθε τμήμα των αποτελεσμάτων και θα
 * χρησιμοποιούνται ως παράμετροι στην κλήση για τη λήψη του επόμενου τμήματος
 * αποτελεσμάτων.</p>
 */
class RequestTransmittedDocs extends MyDataGetRequest
{
    
}