<?php

namespace Firebed\AadeMyData\Models\Enums;

class IncomeClassificationCode
{
    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Εμπορεύματα
     */
    public const E3_106 = "E3_106";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
     */
    public const E3_205 = "E3_205";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
     */
    public const E3_210 = "E3_210";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις – Καταστροφές αποθεμάτων/Πρώτες ύλες και λοιπά υλικά
     */
    public const E3_305 = "E3_305";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Προϊόντα και παραγωγή σε εξέλιξη
     */
    public const E3_310 = "E3_310";


    /**
     *  Ιδιοπαραγωγή παγίων - Αυτοπαραδόσεις - Καταστροφές αποθεμάτων/Έξοδα παραγωγής
     */
    public const E3_318 = "E3_318";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Χονδρικές - Επιτηδευματιών
     */
    public const E3_561_001 = "E3_561_001";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Χονδρικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
     */
    public const E3_561_002 = "E3_561_002";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λιανικές - Ιδιωτική Πελατεία
     */
    public const E3_561_003 = "E3_561_003";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λιανικές βάσει άρθρου 39α παρ 5 του Κώδικα Φ.Π.Α. (Ν.2859/2000)
     */
    public const E3_561_004 = "E3_561_004";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Ενδοκοινοτικές
     */
    public const E3_561_005 = "E3_561_005";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Εξωτερικού Τρίτες Χώρες
     */
    public const E3_561_006 = "E3_561_006";


    /**
     *  Πωλήσεις αγαθών και υπηρεσιών Λοιπά
     */
    public const E3_561_007 = "E3_561_007";


    /**
     *  Λοιπά συνήθη έσοδα
     */
    public const E3_562 = "E3_562";


    /**
     *  Πιστωτικοί τόκοι και συναφή έσοδα
     */
    public const E3_563 = "E3_563";


    /**
     *  Πιστωτικές συναλλαγματικές διαφορές
     */
    public const E3_564 = "E3_564";


    /**
     *  Έσοδα συμμετοχών
     */
    public const E3_565 = "E3_565";


    /**
     *  Κέρδη από διάθεση μη κυκλοφορούντων περιουσιακών στοιχείων
     */
    public const E3_566 = "E3_566";


    /**
     *  Κέρδη από αναστροφή προβλέψεων και απομειώσεων
     */
    public const E3_567 = "E3_567";


    /**
     *  Κέρδη από επιμέτρηση στην εύλογη αξία
     */
    public const E3_568 = "E3_568";


    /**
     *  Ασυνήθη έσοδα και κέρδη
     */
    public const E3_570 = "E3_570";


    /**
     *  Έξοδα σε ιδιοπαραγωγή
     */
    public const E3_595 = "E3_595";


    /**
     *  Επιδοτήσεις - Επιχορηγήσεις
     */
    public const E3_596 = "E3_596";


    /**
     *  Επιδοτήσεις - Επιχορηγήσεις για επενδυτικούς σκοπούς - κάλυψη δαπανών
     */
    public const E3_597 = "E3_597";


    /**
     *  Πωλήσεις Παγίων Χονδρικές
     */
    public const E3_880_001 = "E3_880_001";


    /**
     *  Πωλήσεις Παγίων Λιανικές
     */
    public const E3_880_002 = "E3_880_002";


    /**
     *  Πωλήσεις Παγίων Εξωτερικού Ενδοκοινοτικές
     */
    public const E3_880_003 = "E3_880_003";


    /**
     *  Πωλήσεις Παγίων Εξωτερικού Τρίτες Χώρες
     */
    public const E3_880_004 = "E3_880_004";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Χονδρικές
     */
    public const E3_881_001 = "E3_881_001";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Λιανικές
     */
    public const E3_881_002 = "E3_881_002";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Ενδοκοινοτικές
     */
    public const E3_881_003 = "E3_881_003";


    /**
     *  Πωλήσεις για λογ/σμο Τρίτων Εξωτερικού Τρίτες Χώρες
     */
    public const E3_881_004 = "E3_881_004";
}