<?php

namespace Firebed\AadeMyData\Models\Enums;

class OtherTaxes
{
    /**
     *  α1) ασφάλιστρα κλάδου πυρός 20%
     */
    public const TAX_1 = "1";


    /**
     *  α2) ασφάλιστρα κλάδου πυρός 20%
     */
    public const TAX_2 = "2";


    /**
     *  β) ασφάλιστρα κλάδου ζωής 4%
     */
    public const TAX_3 = "3";


    /**
     *  γ) ασφάλιστρα λοιπών κλάδων 15%.
     */
    public const TAX_4 = "4";


    /**
     *  δ) απαλλασσόμενα φόρου ασφαλίστρων 0%.
     */
    public const TAX_5 = "5";


    /**
     *  Ξενοδοχεία 1-2 αστέρων 0,50 €
     */
    public const TAX_6 = "6";


    /**
     *  Ξενοδοχεία 3 αστέρων 1,50 €
     */
    public const TAX_7 = "7";


    /**
     *  Ξενοδοχεία 4 αστέρων 3,00 €
     */
    public const TAX_8 = "8";


    /**
     *  Ξενοδοχεία 4 αστέρων 4,00 €
     */
    public const TAX_9 = "9";


    /**
     *  Ενοικιαζόμενα - επιπλωμένα δωμάτια - διαμερίσματα 0,50 € ποσό myDATA REST API 48
     */
    public const TAX_10 = "10";


    /**
     *  Ειδικός Φόρος στις διαφημίσεις που προβάλλονται από την τηλεόραση (ΕΦΤΔ) 5%
     */
    public const TAX_11 = "11";


    /**
     *  3.1 Φόρος πολυτελείας 10% επί της φορολογητέας αξίας για τα ενδοκοινοτικώς αποκτούμενα και εισαγόμενα από τρίτες χώρες 10%
     */
    public const TAX_12 = "12";


    /**
     *  3.2 Φόρος πολυτελείας 10% επί της τιμής πώλησης προ Φ.Π.Α. για τα εγχωρίως παραγόμενα  είδη 10%
     */
    public const TAX_13 = "13";


    /**
     *  Δικαίωμα του Δημοσίου στα εισιτήρια των καζίνο (80% επί του εισιτηρίου)
     */
    public const TAX_14 = "14";


    /**
     *  ασφάλιστρα κλάδου πυρός 20%
     */
    public const TAX_15 = "15";


    /**
     *  Τελωνειακοί Δασμοί-Φόροι
     */
    public const TAX_16 = "16";


    /**
     *  Λοιποί Φόροι
     */
    public const TAX_17 = "17";


    /**
     *  Επιβαρύνσεις Λοιπών Φόρων
     */
    public const TAX_18 = "18";
}